# coding: utf-8
# license: GPLv3

class System_Objects:

    type = "Unknown"

    m = 0
    """Масса тела"""

    x = 0
    """Координата по оси **x**"""

    y = 0
    """Координата по оси **y**"""

    Vx = 0
    """Скорость по оси **x**"""

    Vy = 0
    """Скорость по оси **y**"""

    Fx = 0
    """Сила по оси **x**"""

    Fy = 0
    """Сила по оси **y**"""



    color = "red"
    """Цвет звезды"""

    image = None
    """Изображение звезды"""

class Star(System_Objects):
    """Тип данных, описывающий звезду.
    Содержит массу, координаты, скорость звезды,
    а также визуальный радиус звезды в пикселах и её цвет.
    """

    type = "star"
    """Признак объекта звезды"""

    R = 5
    """Радиус тела"""


class Planet(System_Objects):
    """Тип данных, описывающий планету.
    Содержит массу, координаты, скорость планеты,
    а также визуальный радиус планеты в пикселах и её цвет
    """

    type = "planet"
    """Признак объекта планеты"""

    R = 5
    """Радиус тела"""

